aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx65x/r_s12ad_rx65x.c
/* In RAM */

adc_ctrl_t g_dcb[2] = {{ADC_MODE_MAX,
                        NULL,
                        false,
                        GRPBL1_S12CMPIA0_FLAG,
                        GRPBL1_S12CMPIB0_FLAG},

                       {ADC_MODE_MAX,
                        NULL,
                        false,
                        GRPBL1_S12CMPIA1_FLAG,
                        GRPBL1_S12CMPIB1_FLAG}};

/* In ROM. A/D Data Register pointers */

volatile __evenaccess uint16_t * const  dreg0_ptrs[ADC_REG_MAX+1] =
                      { &S12AD.ADDR0,       // channel 0
                        &S12AD.ADDR1,       // channel 1
                        &S12AD.ADDR2,       // channel 2
                        &S12AD.ADDR3,
                        &S12AD.ADDR4,
                        &S12AD.ADDR5,
                        &S12AD.ADDR6,
                        &S12AD.ADDR7,
                        NULL,
                        NULL,
                        NULL,               // channel 10
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,               // channel 20
                        NULL,               // sensor
                        NULL,
                        &S12AD.ADDBLDR.WORD, // double trigger register
                        &S12AD.ADDBLDRA,    // double trigger registerA
                        &S12AD.ADDBLDRB,    // double trigger registerB
                        &S12AD.ADRD.WORD    // self-diagnosis register
                      };

volatile __evenaccess uint16_t * const  dreg1_ptrs[ADC_REG_MAX+1] =
                      { &S12AD1.ADDR0,       // channel 0
                        &S12AD1.ADDR1,       // channel 1
                        &S12AD1.ADDR2,       // channel 2
                        &S12AD1.ADDR3,
                        &S12AD1.ADDR4,
                        &S12AD1.ADDR5,
                        &S12AD1.ADDR6,
                        &S12AD1.ADDR7,
                        &S12AD1.ADDR8,
                        &S12AD1.ADDR9,
                        &S12AD1.ADDR10,
                        &S12AD1.ADDR11,
                        &S12AD1.ADDR12,
                        &S12AD1.ADDR13,
                        &S12AD1.ADDR14,
                        &S12AD1.ADDR15,
                        &S12AD1.ADDR16,
                        &S12AD1.ADDR17,
                        &S12AD1.ADDR18,
                        &S12AD1.ADDR19,
                        &S12AD1.ADDR20,
                        &S12AD1.ADTSDR,    // temperature sensor
                        &S12AD1.ADOCDR,    // voltage sensor
                        &S12AD1.ADDBLDR,   // double trigger register
                        &S12AD1.ADDBLDRA,  // double trigger registerA
                        &S12AD1.ADDBLDRB,  // double trigger registerB
                        &S12AD1.ADRD.WORD  // self-diagnosis register
                      };


/* In ROM. Sample State (SST) Register pointers */

/* 8-bit register pointers */
volatile __evenaccess uint8_t * const  sreg0_ptrs[ADC_SST_REG_MAX+1] =
                      { &S12AD.ADSSTR0,     // channel 0
                        &S12AD.ADSSTR1,     // channel 1
                        &S12AD.ADSSTR2,     // channel 2
                        &S12AD.ADSSTR3,
                        &S12AD.ADSSTR4,
                        &S12AD.ADSSTR5,
                        &S12AD.ADSSTR6,
                        &S12AD.ADSSTR7,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL
                      };


volatile __evenaccess uint8_t * const  sreg1_ptrs[ADC_SST_REG_MAX+1] =
                      { &S12AD1.ADSSTR0,     // channel 0
                        &S12AD1.ADSSTR1,     // channel 1
                        &S12AD1.ADSSTR2,     // channel 2
                        &S12AD1.ADSSTR3,
                        &S12AD1.ADSSTR4,
                        &S12AD1.ADSSTR5,
                        &S12AD1.ADSSTR6,
                        &S12AD1.ADSSTR7,
                        &S12AD1.ADSSTR8,
                        &S12AD1.ADSSTR9,
                        &S12AD1.ADSSTR10,
                        &S12AD1.ADSSTR11,
                        &S12AD1.ADSSTR12,
                        &S12AD1.ADSSTR13,
                        &S12AD1.ADSSTR14,
                        &S12AD1.ADSSTR15,
                        &S12AD1.ADSSTRL,     // channels 16-20
                        &S12AD1.ADSSTRT,     // temperature sensor
                        &S12AD1.ADSSTRO      // voltage sensor
                      };


/******************************************************************************
* Function Name: adc_open
* Description  : This function applies power to the A/D peripheral, sets the
*                operational mode, trigger sources, interrupt priority, and
*                configurations common to all channels and sensors. If interrupt
*                priority is non-zero, the function takes a callback function
*                pointer for notifying the user at interrupt level whenever a
*                scan has completed.
*
* Arguments    : unit -
*                    0 or 1
*                mode -
*                    Operational mode (see enumeration below)
*                p_cfg-
*                    Pointer to configuration structure (see below)
*                p_callback-
*                    Optional pointer to function called from interrupt when
*                    a scan completes
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_AD_LOCKED-
*                    Open() call is in progress elsewhere
*                ADC_ERR_AD_NOT_CLOSED-
*                    Peripheral is still running in another mode; Perform
*                    R_ADC_Close() first
*                ADC_ERR_INVALID_ARG-
*                    mode or element of p_cfg structure has invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon mode
*                ADC_ERR_MISSING_PTR-
*                    p_cfg pointer is FIT_NO_PTR/NULL
*******************************************************************************/
adc_err_t adc_open(uint8_t const          unit,
                   adc_mode_t const       mode,
                   adc_cfg_t * const      p_cfg,
                   void         (* const  p_callback)(void *p_args))
{
    aregs_t     *p_regs;
    volatile uint16_t   u16_dummy;  /* Dummy read for "1" change to "0".(read first) */
    volatile uint8_t    u8_dummy;   /* Dummy read for "1" change to "0".(read first) */

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    if ((NULL == p_cfg) || (FIT_NO_PTR == p_cfg))
    {
        return ADC_ERR_MISSING_PTR;
    }

    err = adc_check_open_cfg(unit, mode, p_cfg, p_callback);
    if (err != ADC_SUCCESS)
    {
        return err;
    }
#endif

    /* ENSURE OPEN() NOT ALREADY IN PROGRESS */

    if (true == g_dcb[unit].opened)
    {
        return ADC_ERR_AD_NOT_CLOSED;
    }
    if (R_BSP_HardwareLock(ADC_LOCK(unit)) == false)
    {
        return ADC_ERR_AD_LOCKED;
    }


