aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx65x/r_s12ad_rx65x.c
    if ((NULL != g_dcb[0].callback) && (FIT_NO_FUNC != g_dcb[0].callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 0;
        g_dcb[0].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_s12adi1_isr
* Description  : Unit1 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(adc_s12adi1_isr, VECT(S12ADC1,S12ADI1))
static void adc_s12adi1_isr(void)
{
adc_cb_args_t   args;

    if ((NULL != g_dcb[1].callback) && (FIT_NO_FUNC != g_dcb[1].callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 1;
        g_dcb[1].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_s12gbadi0_isr
* Description  : Unit0 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi0_isr, VECT(S12ADC0,S12GBADI0))
static void adc_s12gbadi0_isr(void)
{
adc_cb_args_t   args;

    if ((NULL != g_dcb[0].callback) && (FIT_NO_FUNC != g_dcb[0].callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE_GROUPB;
        args.unit = 0;
        g_dcb[0].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_s12gbadi1_isr
* Description  : Unit1 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi1_isr, VECT(S12ADC1,S12GBADI1))
static void adc_s12gbadi1_isr(void)
{
adc_cb_args_t   args;

    if ((NULL != g_dcb[1].callback) && (FIT_NO_FUNC != g_dcb[1].callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE_GROUPB;
        args.unit = 1;
        g_dcb[1].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_s12gbadi0_isr
* Description  : Unit0 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi0_isr, VECT(S12ADC0,S12GCADI0))
static void adc_s12gcadi0_isr(void)
{
adc_cb_args_t   args;

    if ((NULL != g_dcb[0].callback) && (FIT_NO_FUNC != g_dcb[0].callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE_GROUPC;
        args.unit = 0;
        g_dcb[0].callback(&args);
    }
}


/*****************************************************************************
* Function Name: adc_s12gbadi1_isr
* Description  : Unit1 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi1_isr, VECT(S12ADC1,S12GCADI1))
static void adc_s12gcadi1_isr(void)
{
adc_cb_args_t   args;

    if ((NULL != g_dcb[1].callback) && (FIT_NO_FUNC != g_dcb[1].callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE_GROUPC;
        args.unit = 1;
        g_dcb[1].callback(&args);
    }
}


/******************************************************************************
* Function Name: adc_close
* Description  : This is implementation of R_ADC_Close().
*                This function ends any scan in progress, disables interrupts,
*                and removes power to the A/D peripheral.
* Arguments    : none
* Return Value : none
*******************************************************************************/
adc_err_t adc_close(uint8_t const  unit)
{
aregs_t     *p_regs = GET_REGS_PTR(unit);
volatile    uint8_t i;

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    if (unit > 1)
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif

    /* Stop triggers & conversions, and disable peripheral interrupts */
    if (0 == unit)
    {
        IEN(S12ADC0,S12ADI0) = 0;         // disable interrupts in ICU
        IEN(S12ADC0,S12GBADI0) = 0;       // disable interrupts in ICU
        IEN(S12ADC0,S12GCADI0) = 0;       // disable interrupts in ICU

        IPR(S12ADC0,S12ADI0) = 0;
        IPR(S12ADC0,S12GBADI0) = 0;
        IPR(S12ADC0,S12GCADI0) = 0;
    }

    else /* Unit1 */
    {
        IEN(S12ADC1,S12ADI1) = 0;         // disable interrupts in ICU
        IEN(S12ADC1,S12GBADI1) = 0;       // disable interrupts in ICU
        IEN(S12ADC1,S12GCADI1) = 0;       // disable interrupts in ICU

        IPR(S12ADC1,S12ADI1) = 0;
        IPR(S12ADC1,S12GBADI1) = 0;
        IPR(S12ADC1,S12GCADI1) = 0;
    }

    /* This program does not disable IPR register of Group interrupt.
     * Because, other peripheral is possible to use same vector Group interrupt. */
    IEN(ICU,GROUPBL1) = 0;                      // disable group
    ICU.GENBL1.LONG &= ~g_dcb[unit].cmpi_mask;  // disable group subvector
    ICU.GENBL1.LONG &= ~g_dcb[unit].cmpi_maskb;   // disable group subvector
    p_regs->ADCMPCR.BIT.CMPAIE = 0;             // disable interrupt in ADC
    if (0 == p_regs->ADCMPCR.BIT.CMPAIE)        // dummy read for waiting until set the value of CMPIE
    {
        nop();
    }

    p_regs->ADCMPCR.BIT.CMPBIE = 0;             // disable interrupt in ADC
    if (0 == p_regs->ADCMPCR.BIT.CMPBIE)        // dummy read for waiting until set the value of CMPIE
    {
        nop();
    }

    if (1 == p_regs->ADGSPCR.BIT.PGS)
    {
        p_regs->ADGSPCR.BIT.PGS = 0;
    }

    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        p_regs->ADSTRGR.WORD = 0x3F3F;
        if (1 == p_regs->ADGCTRGR.BIT.GRCE)
        {
            p_regs->ADGCTRGR.BIT.TRSC = 0x3F;
            p_regs->ADGCTRGR.BIT.GCADIE = 0;
            p_regs->ADGCTRGR.BIT.GRCE = 0;
        }
        p_regs->ADCSR.BIT.GBADIE = 0;
    }
    else
    {
        p_regs->ADSTRGR.BIT.TRSA = 0x3F;
        p_regs->ADCSR.BIT.ADIE = 0;
    }

